// https://nuxt.com/docs/api/configuration/nuxt-config
export default defineNuxtConfig({
  devtools: { enabled: false },

  nitro: {
    prerender: {
      routes: [
        "/",
        "/документація",
        "/документація/вказівки",
        "/документація/встановлення",
        "/документація/дії",
        "/документація/композиції",
        "/документація/модулі",
        "/документація/перша-програма",
        "/документація/приклади",
        "/документація/структури",
        "/документація/субʼєкти",
        "/документація/цілі",
        "/документація/змінні",
      ],
      failOnError: false,
    },
  },
});
