#!/usr/bin/env sh

VERSION="$(cat "ВЕРСІЯ")"

rm -rf ".будування/$VERSION"

докс перетворити --вхід=документація --вихід=".будування/$VERSION/документація" --вигляд=тема
докс перетворити --вхід=інформація --вихід=".будування/інформація" --вигляд=тема
докс перетворити --вхід=архів --вихід=".будування/архів" --вигляд=тема
cp -a ресурси index.html 404.html robots.txt .будування
докс карта --вхід=.будування --вихід=.будування --домен=ціль.дійсність.укр
find .будування -type f -name "*.html" -exec sed -i "s/{{ВЕРСІЯ_ЦІЛІ}}/$VERSION/g" {} \;