<script setup lang="ts">
import UiDocsWrapper from "~/components/UiDocsWrapper.vue";

const example1 = `
// дія для виділення памʼяті для
// вказаної кількості елементів вказаного типу
дія виділити<Т>(кількість: ціле) -> комірка<Т>;

// дія для виділення памʼяті
// для вказаної кількості байт
дія виділити_байти(розмір: ціле) -> невідома_комірка;

// дія для перевиділення памʼяті для
// вказаної кількості елементів вказаного типу
дія перевиділити<Т>(ком: комірка<Т>, кількість: ціле) -> комірка<Т>;

// дія для перевиділення памʼяті
// для вказаної кількості байт
дія перевиділити_байти(ком: невідома_комірка, розмір: ціле) -> невідома_комірка;

// дія для звільнення памʼяті
дія звільнити(ком: невідома_комірка);

// дія для отримання комірки на значення на стеку
дія комірка<Т>(значення: Т) -> комірка<Т>;

// дія для копіювання значення з комірки на стек
дія значення<Т>(ком: комірка<Т>) -> Т;

// дія для копіювання значення з однієї комірки в іншу
дія скопіювати(куди: невідома_комірка, що: невідома_комірка, розмір: ціле);

// дія для заповнення памʼяті
дія заповнити(куди: невідома_комірка, значення: ціле, розмір: ціле);

// дія для порівняння двох комірок
дія порівняти(к1: невідома_комірка, к2: невідома_комірка, розмір: ціле) -> ц32;
`.trim();

useHead({
  title: "Памʼять | Документація | Ціль",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/секції">
    <h1 class="UiDocsLayoutTitle">Памʼять</h1>
    <p>Робота з памʼятю в цілі відбувається в ручному режимі.</p>
    <p>Дії для роботи з памʼятю:</p>
    <UiCodeBlock :code="example1" borderless />
  </UiDocsWrapper>
</template>
