<script setup lang="ts">
import UiDocsWrapper from "~/components/UiDocsWrapper.vue";

const example1 = `
структура Вектор2 {
  а: ц64;
  б: ц64;
}

ціль точка = Вектор2 {
  а: 2,
  б: 2,
};

ціль точка_в_коморі: комірка<Вектор2> = покласти Вектор2 {
  а: 2,
  б: 2,
};

// ---

екстерн дія друк_ц64(значення: ц64);
екстерн дія printf(значення: невідома_комірка);

структура Людина {
  імʼя: текст;
}

дія вивести(значення: текст) {
  printf(значення.дані);
}

дія привітатись(л: Людина) {
  вивести("Привіт, ");
  вивести(л.імʼя);
  вивести("!\\n");
}

екстерн дія main(): ц32 {
  ціль василь: Людина;
  василь.імʼя = "Василь";
  привітатись(василь);
  вернути 0;
}

`.trim();

useHead({
  title: "Структури | Документація | Ціль",
});

definePageMeta({
  layout: "docs",
});
</script>

<template>
  <UiDocsWrapper prev="/документація/дії" next="/документація/композиції">
    <h1 class="UiDocsLayoutTitle">Структури</h1>
    <UiCodeBlock :code="example1" borderless />
  </UiDocsWrapper>
</template>
